OpenFOAM-v2112-AD/tutorials/mesh/parallel/filter/0.orig/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -3 0 0 0 0 ];

internalField   uniform 0.0449;

boundaryField
{
    walls
    {
        type            epsilonWallFunction;
        value           uniform 0.0449;
    }

    inlet
    {
        type            fixedValue;
        value           uniform 0.0449;
    }

    outlet
    {
        type            zeroGradient;
    }

    cycLeft_half0
    {
        type            cyclic;
    }

    cycRight_half0
    {
        type            cyclic;
    }

    frontAndBack
    {
        type            empty;
    }

    cycLeft_half1
    {
        type            cyclic;
    }

    cycRight_half1
    {
        type            cyclic;
    }
}


// ************************************************************************* //
